name: "test"
backend: "python"

input [
    {
        name: "image"
        dims: [-1, -1, 3]
        data_type: TYPE_UINT8
    }
]

output [
    {
        name: "pred_boxes"
        data_type: TYPE_FP32
        dims: [-1, 4]
    },
    {
        name: "scores"
        data_type: TYPE_FP32
        dims: [-1]
    },
    {
        name: "pred_classes"
        data_type: TYPE_INT64
        dims: [-1]
    }
]

instance_group [
    {
        kind: KIND_GPU
        count: 1
    }
]

parameters {
    key: "EXECUTION_ENV_PATH"
    value: {string_value: "$$TRITON_MODEL_DIRECTORY/../triton.tar.gz"}
}